// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б

// function Plosha(a,b){
//     let resalt = a * b
//     return resalt
// }

// - створити функцію яка обчислює та повертає площу кола з радіусом r
//
// function Kolo(r){
//     let resalt = 3.14 * r ** 2
//     return Plosha
// }

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r

// function Cylinder(h,r){
//     return  2*3.14*r*(h+r)
// }
//
// console.log(Cylinder(2, 2));

// - створити функцію яка приймає масив та виводить кожен його елемент

// function Caunter(array){
//     for (const arrayElement of array) {
//         console.log(arrayElement);
//     }
// }

// - створити функцію яка створює параграф з текстом. Текст задати через аргумент

// function Paragraf(text){
//     document.write(`<p>${text}</p>`)
// }
// Paragraf('asdasdasdasd')

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// function Spusok(text){
//     document.write(`
//     <ul>
//     <li>${text}</li>
//     <li>${text}</li>
//     <li>${text}</li>
//     </ul>
//     `)
// }
//
// Spusok('sxasxasxa')

// - створити функцію яка створює ul з трьома елементами li.
// Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

function Spysok(text, i){

}

// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13